# Q1

A U.S graduate school has students from Asia, Europe, and America. The students' continents of origin and colleges are stored in a data frame STUDENTS. You can assume that there may be duplicate records, as shown below:

Please write R or Pandas code to create a new data frame COUNTS that counts the number of unique student records corresponding to each continent, college pair. Lay out the data in a 3x3 grid with colleges sorted reverse alphabetically on the vertical axis. The horizontal axis does not need to be sorted. Null values should be zero-filled. For the sample input, the desired output would be:

In [1]:
import random
import pandas as pd

In [2]:
columns = ["name", "continent", "college"]
names = ["Andy", "kangnam", "Annie", "Keith", "Messi", "Ronaldo", "Jordan", "Jose", "Angel", "Garen"]
colleges = ["Business", "Lib Arts", "Engineering"]
continents = ["Asia", "America", "Europe"]

In [3]:
def define_students(
    names: list, continents: list, colleges: list
) -> list[list[str, str, str]]:
    students = []
    for name in names:
        continent = random.choice(continents)
        college = random.choice(colleges)
        student = [name, continent, college]
        students.append(student)
    return students

In [4]:
students = define_students(names=names, continents=continents, colleges=colleges)
students_sample = random.choices(students, k=1000)

In [5]:
data = {columns[0]: [], columns[1]: [], columns[2]: []}

for student in students_sample:
    name = student[0]
    continent = student[1]
    college = student[2]
        
    data[columns[0]].append(name)
    data[columns[1]].append(continent)
    data[columns[2]].append(college)
STUDENTS = pd.DataFrame(data)
STUDENTS.head(10)

      name continent      college
0    Garen   America     Business
1     Andy      Asia  Engineering
2  kangnam   America     Business
3    Angel    Europe     Lib Arts
4   Jordan    Europe     Business
5    Keith      Asia     Business
6    Annie   America     Business
7  Ronaldo      Asia     Lib Arts
8   Jordan    Europe     Business
9    Garen   America     Business

### A) Write R or Pandas code to de-dup STUDENTS (1pt):

In [6]:
df = STUDENTS.drop_duplicates(ignore_index=True)
df.head(10)

      name continent      college
0    Garen   America     Business
1     Andy      Asia  Engineering
2  kangnam   America     Business
3    Angel    Europe     Lib Arts
4   Jordan    Europe     Business
5    Keith      Asia     Business
6    Annie   America     Business
7  Ronaldo      Asia     Lib Arts
8    Messi    Europe     Business
9     Jose    Europe     Business

### B) Create a data frame COUNTS storing the count of students for each continent, college pair (2pts):

In [7]:
count_by_combination = df.groupby(["continent", "college"]).size().reset_index()
print(count_by_combination)

  continent      college  0
0   America     Business  3
1      Asia     Business  1
2      Asia  Engineering  1
3      Asia     Lib Arts  1
4    Europe     Business  3
5    Europe     Lib Arts  1

### C) Pivot COUNTS so that continent values become column names (2pts)

In [8]:
COUNTS = count_by_combination.pivot(index="college", columns = "continent")
print(COUNTS)

                  0
continent   America Asia Europe
college
Business        3.0  1.0    3.0
Engineering     NaN  1.0    NaN
Lib Arts        NaN  1.0    1.0

### D) If applicable, remove any unnecessary index levels created in part C (1pts):

In [9]:
COUNTS

                  0
continent   America Asia Europe
college
Business        3.0  1.0    3.0
Engineering     NaN  1.0    NaN
Lib Arts        NaN  1.0    1.0

In [10]:
COUNTS.columns = COUNTS.columns.get_level_values(1)
COUNTS

continent    America  Asia  Europe
college
Business         3.0   1.0     3.0
Engineering      NaN   1.0     NaN
Lib Arts         NaN   1.0     1.0

### E) Zero-fill missing values in COUNTS (1pt):

In [11]:
COUNTS = COUNTS.fillna(0)
COUNTS

continent    America  Asia  Europe
college
Business         3.0   1.0     3.0
Engineering      0.0   1.0     0.0
Lib Arts         0.0   1.0     1.0

### F) Sort COUNTS reverse alphabetically by college name (1pt):

In [13]:
COUNTS = COUNTS.sort_index(ascending=False).astype(int)
COUNTS

continent    America  Asia  Europe
college
Lib Arts           0     1       1
Engineering        0     1       0
Business           3     1       3